Revit 2024 API
RebarBendingDetail Class
 Utility class with methods needed for the bending details in view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static class RebarBendingDetail
Visual Basic
Public NotInheritable Class RebarBendingDetail
Visual C++
public ref class RebarBendingDetail abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarBendingDetail
See Also
RebarBendingDetail Members
Autodesk.Revit.DB.Structure Namespace